tests/artillery/load.yaml
config:
  target: "https://transactions-backend.test.devpayever.com/api"
  phases:
    - duration: 10
      arrivalRate: 10
  http:
    timeout: 10
  processor: "./processors/load.js"
  variables:
    authUrl: "https://auth.test.devpayever.com/api"
    userUrl: "https://users.test.devpayever.com/api"
    email: "rob@top.com"
    plainPassword: "Test1234!"
  default:
    headers:
      content-type: "application/json"
  environments:
    test:
      target: "https://transactions-backend.test.devpayever.com/api"
      phases:
        - duration: 1200
          arrivalRate: 20
      variables:
        authUrl: "https://auth.test.devpayever.com/api"
        userUrl: "https://users.test.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
    staging:
      target: "https://transactions-backend.staging.devpayever.com/api"
      phases:
        - duration: 1200
          arrivalRate: 20
      variables:
        authUrl: "https://auth.staging.devpayever.com/api"
        userUrl: "https://users.test.devpayever.com/api"
        email: "rob@top.com"
        plainPassword: "Test1234!"
scenarios:
  - name: "Integration"
    flow:
      - function: "defineIntegrationVariables"
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "POST /integration"
      - post:
          url: "/integration"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            default: False
            name: "{{ integrationName }}"
            category: "{{ category }}"
      - log: "GET /integration"
      - get:
          url: "/integration"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /integration/{{ integrationName }}"
      - get:
          url: "/integration/{{ integrationName }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
  - name: "Business"
    flow:
      - function: "defineBusinessVariables"
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "Get business ID"
      - get:
          url: "{{ userUrl }}/business"
          headers:
            authorization: "Bearer {{ accessToken }}"
          afterResponse: "defineBusinessId"
      - log: "GET /business/{{ businessId }}/list"
      - get:
          url: "/business/{{ businessId }}/list"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/mongo"
      - get:
          url: "/business/{{ businessId }}/mongo"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/export"
      - get:
          url: "/business/{{ businessId }}/export"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/settings"
      - get:
          url: "/business/{{ businessId }}/settings"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "POST /business/{{ businessId }}/trigger-example"
      - post:
          url: "/business/{{ businessId }}/trigger-example"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            _id: "{{ business_Id }}"
            name: "{{ businessName }}"
            currency: "EUR"
            companyAddress:
              country: "Germany"
            companyDetails:
              product: "product"
      - log: "GET /business/{{ businessId }}/detail/reference/{{ reference }}"
      - get:
          url: "/business/{{ businessId }}/detail/reference/{{ reference }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/detail/original_id/{{ originalId }}"
      - get:
          url: "/business/{{ businessId }}/detail/original_id/{{ originalId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/detail/{{ transactionId }}"
      - get:
          url: "/business/{{ businessId }}/detail/{{ transactionId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/{{ transactionId }}/update-status"
      - get:
          url: "/business/{{ businessId }}/{{ transactionId }}/update-status"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/{{ transactionId }}/label/{{ pdf }}"
      - get:
          url: "/business/{{ businessId }}/{{ transactionId }}/label/{{ pdf }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /business/{{ businessId }}/{{ transactionId }}/slip/{{ slip }}"
      - get:
          url: "/business/{{ businessId }}/{{ transactionId }}/slip/{{ slip }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "POST /business/{{ businessId }}/{{ transactionId }}/action/{{ action }}"
      - post:
          url: "/business/{{ businessId }}/{{ transactionId }}/action/{{ action }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            fields: {}
            files: []
      - log: "POST /business/{{ businessId }}/{{ transactionId }}/legacy-api-action/{{ action }}"
      - post:
          url: "/business/{{ businessId }}/{{ transactionId }}/legacy-api-action/{{ action }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
          json:
            fields: {}
            files: []
  - name: "Admin"
    flow:
      - function: "defineAdminVariables"
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "GET /admin/list"
      - get:
          url: "/admin/list"
          headers:
            authorization: "Bearer {{ accessToken }}"
          afterResponse: "defineAdminId"
      - log: "GET /admin/mongo"
      - get:
          url: "/admin/mongo"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /admin/detail/{{ adminId }}"
      - get:
          url: "/admin/detail/{{ adminId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "POST /admin/{{ adminId }}/action/edit"
      - post:
          url: "/admin/{{ adminId }}/action/shipping_goods"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /admin/{{ adminId }}/update-status"
      - get:
          url: "/admin/{{ adminId }}/update-status"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /admin/settings"
      - get:
          url: "/admin/settings"
          headers:
            authorization: "Bearer {{ accessToken }}"
  - name: "User"
    flow:
      - log: "Login"
      - post:
          url: "{{ authUrl }}/login"
          json:
            email: "{{ email }}"
            plainPassword: "{{ plainPassword }}"
          capture:
            - json: "$.accessToken"
              as: "accessToken"
      - log: "GET /user/list"
      - get:
          url: "/user/list"
          headers:
            authorization: "Bearer {{ accessToken }}"
          afterResponse: "defineUserId"
      - log: "GET /user/mongo"
      - get:
          url: "/user/mongo"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /user/detail/{{ userId }}"
      - get:
          url: "/user/detail/{{ userId }}"
          headers:
            authorization: "Bearer {{ accessToken }}"
      - log: "GET /user/settings"
      - get:
          url: "/user/settings"
          headers:
            authorization: "Bearer {{ accessToken }}"